[
  {
    "ident": "brave-bird",
    "type_ident": "flying",
    "category_ident": "physical",
    "base_power": 120,
    "accuracy": 1,
    "priority": 0,
    "pp": 15,
    "description": "If the target lost HP, the user takes recoil damage equal to 33% the HP lost by the target, rounded half up, but not less than 1 HP."
  },
  {
    "ident": "energy-ball",
    "type_ident": "grass",
    "category_ident": "special",
    "base_power": 90,
    "accuracy": 1,
    "priority": 0,
    "pp": 10,
    "description": "Has a 10% chance to lower the target's Special Defense by 1 stage.",
    "stat_changes": [
      {
        "stat_ident": "special_defense",
        "stages": -1,
        "frequency": 0.1
      }
    ]
  },
  {
    "ident": "feint",
    "type_ident": "normal",
    "category_ident": "physical",
    "base_power": 30,
    "accuracy": 1,
    "priority": 2,
    "pp": 10,
    "description": "If this move is successful, it breaks through the target's Baneful Bunker, Detect, King's Shield, Protect, or Spiky Shield for this turn, allowing other Pokemon to attack the target normally. If the target's side is protected by Crafty Shield, Mat Block, Quick Guard, or Wide Guard, that protection is also broken for this turn and other Pokemon may attack the target's side normally."
  },
  {
    "ident": "flare-blitz",
    "type_ident": "fire",
    "category_ident": "physical",
    "base_power": 120,
    "accuracy": 1,
    "priority": 0,
    "pp": 15,
    "description": "Has a 10% chance to burn the target. If the target lost HP, the user takes recoil damage equal to 33% the HP lost by the target, rounded half up, but not less than 1 HP."
  },
  {
    "ident": "tailwind",
    "type_ident": "flying",
    "category_ident": "non-damaging",
    "base_power": null,
    "accuracy": null,
    "priority": 0,
    "pp": 15,
    "description": "For 4 turns, the user and its party members have their Speed doubled. Fails if this move is already in effect for the user's side."
  },
  {
    "ident": "u-turn",
    "type_ident": "bug",
    "category_ident": "physical",
    "base_power": 70,
    "accuracy": 1,
    "priority": 0,
    "pp": 32,
    "description": "If this move is successful and the user has not fainted, the user switches out even if it is trapped and is replaced immediately by a selected party member. The user does not switch out if there are no unfainted party members, or if the target switched out using an Eject Button or through the effect of the Emergency Exit or Wimp Out Abilities."
  }
]
